name: "TestNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { 
    shape: { 
      dim: 64 
      dim: 1 
      dim: 28 
      dim: 28 
    } 
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 20
    kernel_size: {
      dim: 1 
      dim: 7 
      dim: 7 
      dim: 1 
    }
    stride: 1
    weight_filler {
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "ip1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "ip1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: {
      dim: 1 
      dim: 7 
      dim: 7 
      dim: 1 
    }
    stride: 2
  }
}