name: "TestNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { 
    shape: { 
      dim: -1
      dim: 25
      dim: 25 
      dim: 4 
    } 
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 16
    kernel_size: {
      dim: 5 
      dim: 5 
    }
    stride: {
      dim: 1 
      dim: 1 
    }
    weight_filler {
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "ip1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "ip1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: {
      dim: 1
      dim: 1 
      dim: 1
      dim: 1 
    }
    stride: {
      dim: 1
      dim: 1 
      dim: 1
      dim: 1 
    }
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 4
    kernel_size: {
      dim: 5 
      dim: 5 
    }
    stride: {
      dim: 1 
      dim: 1 
    }
    weight_filler {
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "ip2"
  type: "ReLU"
  bottom: "conv2"
  top: "ip2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "ip2"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: {
      dim: 1
      dim: 1
      dim: 1
      dim: 1 
    }
    stride: {
      dim: 1
      dim: 25
      dim: 25
      dim: 1 
    }
  }
}
layer {
  name: "output"
  type: "Flatten"
  bottom: "pool2"
  top: "flatten_out"
}